/*
    암묵적 형변환
*/

/*
    문자열 타입으로 형변환
    - 
*/



console.log('==============================');

/*
    숫자 타입으로 형변환
    - 
*/



console.log('==============================');

/*
    불리언 타입으로 형변환
    - 
*/



console.log('==============================');

/*
    명시적 형변환
*/

/*
    문자열 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    숫자 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    불리언 타입으로 형변환
    - 
    - 
*/



console.log('==============================');

/*
    단축 평가 
    - 
    - 
    - 
    - 
    - 
*/


